OpenNuvoton/NUC970_NonOS_BSP/Driver/Include/nuc970.h
#define     REG_GPIOJ_DIR       (GPIO_BA+0x240)  /*!< GPIO port J direction control register */
#define     REG_GPIOJ_DATAOUT   (GPIO_BA+0x244)  /*!< GPIO port J data output register */
#define     REG_GPIOJ_DATAIN    (GPIO_BA+0x248)  /*!< GPIO port J data input register */
#define     REG_GPIOJ_IMD       (GPIO_BA+0x24C)  /*!< GPIO Port J Interrupt Mode Register */
#define     REG_GPIOJ_IREN      (GPIO_BA+0x250)  /*!< GPIO Port J Interrupt Rising-Edge or Level-High Enable Register */
#define     REG_GPIOJ_IFEN      (GPIO_BA+0x254)  /*!< GPIO Port J Interrupt Falling-Edge or Level-Low Enable Register */
#define     REG_GPIOJ_ISR       (GPIO_BA+0x258)  /*!< GPIO Port J Interrupt Status Register */
#define     REG_GPIOJ_DBEN      (GPIO_BA+0x25C)  /*!< GPIO Port J De-bounce Enable Register */
#define     REG_GPIOJ_PUEN      (GPIO_BA+0x260)  /*!< GPIO Port J Pull-Up Enable Register */
#define     REG_GPIOJ_PDEN      (GPIO_BA+0x264)  /*!< GPIO Port J Pull-Down Enable Register */
#define     REG_GPIOJ_ICEN      (GPIO_BA+0x268)  /*!< GPIO Port J CMOS Input Enable Register */
#define     REG_GPIOJ_ISEN      (GPIO_BA+0x26C)  /*!< GPIO Port J Schmitt-Trigger Input Enable Register */

#define     REG_GPIO_DBNCECON   (GPIO_BA+0x3F0)  /*!< GPIO Debounce Control Register */
#define     REG_GPIO_ISR        (GPIO_BA+0x3FC)  /*!< GPIO Port Interrupt Status Register */

/**@}*/ /* end of GPIO register group */


/*---------------------- Real Time Clock Controller -------------------------*/
/**
    @addtogroup RTC Real Time Clock Controller(RTC)
    Memory Mapped Structure for RTC Controller
@{ */

#define     REG_RTC_INIT    (RTC_BA+0x00)   /*!< RTC Initiation Register */
#define     REG_RTC_RWEN    (RTC_BA+0x04)   /*!< RTC Access Enable Register */
#define     REG_RTC_FREQADJ (RTC_BA+0x08)   /*!< RTC Frequency Compensation Register */
#define     REG_RTC_TIME    (RTC_BA+0x0C)   /*!< Time Loading Register */
#define     REG_RTC_CAL     (RTC_BA+0x10)   /*!< Calendar Loading Register */
#define     REG_RTC_TIMEFMT (RTC_BA+0x14)   /*!< Time Format Selection Register */
#define     REG_RTC_WEEKDAY (RTC_BA+0x18)   /*!< Day of the Week Register */
#define     REG_RTC_TALM    (RTC_BA+0x1C)   /*!< Time Alarm Register */
#define     REG_RTC_CALM    (RTC_BA+0x20)   /*!< Calendar Alarm Register */
#define     REG_RTC_LEAPYEAR    (RTC_BA+0x24)   /*!< Leap year Indicator Register */
#define     REG_RTC_INTEN   (RTC_BA+0x28)   /*!< RTC Interrupt Enable Register */
#define     REG_RTC_INTSTS  (RTC_BA+0x2C)   /*!< RTC Interrupt Indicator Register */
#define     REG_RTC_TICK    (RTC_BA+0x30)   /*!< RTC Time Tick Register */
#define     REG_RTC_PWRCTL      (RTC_BA+0x34)   /*!< Power Control Register */
#define     REG_RTC_PWRCNT      (RTC_BA+0x38)   /*!< Power Control Counter Register */
#define     REG_RTC_SPR0        (RTC_BA+0x40)   /*!< Spare REgistger 0 */
#define     REG_RTC_SPR1        (RTC_BA+0x44)   /*!< Spare REgistger 1 */
#define     REG_RTC_SPR2        (RTC_BA+0x48)   /*!< Spare REgistger 2 */
#define     REG_RTC_SPR3        (RTC_BA+0x4C)   /*!< Spare REgistger 3 */
#define     REG_RTC_SPR4        (RTC_BA+0x50)   /*!< Spare REgistger 4 */
#define     REG_RTC_SPR5        (RTC_BA+0x54)   /*!< Spare REgistger 5 */
#define     REG_RTC_SPR6        (RTC_BA+0x58)   /*!< Spare REgistger 6 */
#define     REG_RTC_SPR7        (RTC_BA+0x5C)   /*!< Spare REgistger 7 */
#define     REG_RTC_SPR8        (RTC_BA+0x60)   /*!< Spare REgistger 8 */
#define     REG_RTC_SPR9        (RTC_BA+0x64)   /*!< Spare REgistger 9 */
#define     REG_RTC_SPR10       (RTC_BA+0x68)   /*!< Spare REgistger 10 */
#define     REG_RTC_SPR11       (RTC_BA+0x6C)   /*!< Spare REgistger 11 */
#define     REG_RTC_SPR12       (RTC_BA+0x70)   /*!< Spare REgistger 12 */
#define     REG_RTC_SPR13       (RTC_BA+0x74)   /*!< Spare REgistger 13 */
#define     REG_RTC_SPR14       (RTC_BA+0x78)   /*!< Spare REgistger 14 */
#define     REG_RTC_SPR15       (RTC_BA+0x7C)   /*!< Spare REgistger 15 */

/**@}*/ /* end of RTC register group */

/*---------------------- Inter-IC Bus Controller -------------------------*/
/**
    @addtogroup I2C Inter-IC Bus Controller(I2C)
    Memory Mapped Structure for I2C Controller
@{ */

#define     REG_I2C0_CSR        (I2C0_BA+0x00)  /*!< Control and Status Register */
#define     REG_I2C0_DIVIDER    (I2C0_BA+0x04)  /*!< Clock Prescale Register */
#define     REG_I2C0_CMDR       (I2C0_BA+0x08)  /*!< Command Register */
#define     REG_I2C0_SWR        (I2C0_BA+0x0C)  /*!< Software Mode Control Register */
#define     REG_I2C0_RXR        (I2C0_BA+0x10)  /*!< Data Receive Register */
#define     REG_I2C0_TXR        (I2C0_BA+0x14)  /*!< Data Transmit Register */

#define     REG_I2C1_CSR        (I2C1_BA+0x00)  /*!< Control and Status Register */
#define     REG_I2C1_DIVIDER    (I2C1_BA+0x04)  /*!< Clock Prescale Register */
#define     REG_I2C1_CMDR       (I2C1_BA+0x08)  /*!< Command Register */
#define     REG_I2C1_SWR        (I2C1_BA+0x0C)  /*!< Software Mode Control Register */
#define     REG_I2C1_RXR        (I2C1_BA+0x10)  /*!< Data Receive Register */
#define     REG_I2C1_TXR        (I2C1_BA+0x14)  /*!< Data Transmit Register */

/**@}*/ /* end of I2C register group */


/*---------------------- Serial Peripheral Interface Controller -------------------------*/
/**
    @addtogroup SPI Serial Peripheral Interface Controller(SPI)
    Memory Mapped Structure for SPI Controller
@{ */

#define     REG_SPI0_CNTRL   (SPI0_BA+0x00)  /*!< Control and Status Register */
#define     REG_SPI0_DIVIDER (SPI0_BA+0x04)  /*!< Clock Divider Register */
#define     REG_SPI0_SSR     (SPI0_BA+0x08)  /*!< Slave Select Register */
#define     REG_SPI0_RX0     (SPI0_BA+0x10)  /*!< Data Receive Register 0 */
#define     REG_SPI0_RX1     (SPI0_BA+0x14)  /*!< Data Receive Register 1 */
#define     REG_SPI0_RX2     (SPI0_BA+0x18)  /*!< Data Receive Register 2 */
#define     REG_SPI0_RX3     (SPI0_BA+0x1C)  /*!< Data Receive Register 3 */
#define     REG_SPI0_TX0     (SPI0_BA+0x10)  /*!< Data Transmit Register 0 */
#define     REG_SPI0_TX1     (SPI0_BA+0x14)  /*!< Data Transmit Register 1 */
#define     REG_SPI0_TX2     (SPI0_BA+0x18)  /*!< Data Transmit Register 2 */
#define     REG_SPI0_TX3     (SPI0_BA+0x1C)  /*!< Data Transmit Register 3 */

#define     REG_SPI1_CNTRL   (SPI1_BA+0x00)  /*!< Control and Status Register */
#define     REG_SPI1_DIVIDER (SPI1_BA+0x04)  /*!< Clock Divider Register */
#define     REG_SPI1_SSR     (SPI1_BA+0x08)  /*!< Slave Select Register */
#define     REG_SPI1_RX0     (SPI1_BA+0x10)  /*!< Data Receive Register 0 */
#define     REG_SPI1_RX1     (SPI1_BA+0x14)  /*!< Data Receive Register 1 */
#define     REG_SPI1_RX2     (SPI1_BA+0x18)  /*!< Data Receive Register 2 */
#define     REG_SPI1_RX3     (SPI1_BA+0x1C)  /*!< Data Receive Register 3 */
#define     REG_SPI1_TX0     (SPI1_BA+0x10)  /*!< Data Transmit Register 0 */
#define     REG_SPI1_TX1     (SPI1_BA+0x14)  /*!< Data Transmit Register 1 */
#define     REG_SPI1_TX2     (SPI1_BA+0x18)  /*!< Data Transmit Register 2 */
#define     REG_SPI1_TX3     (SPI1_BA+0x1C)  /*!< Data Transmit Register 3 */

/**@}*/ /* end of SPI register group */


/*---------------------- Pulse Width Modulation Controller -------------------------*/
/**
    @addtogroup PWM Pulse Width Modulation Controller(PWM)
    Memory Mapped Structure for PWM Controller
@{ */

#define     REG_PWM_PPR     (PWM_BA+0x00)  /*!< PWM Pre-scale Register 0 */
#define     REG_PWM_CSR     (PWM_BA+0x04)  /*!< PWM Clock Select Register */
#define     REG_PWM_PCR     (PWM_BA+0x08)  /*!< PWM Control Register */
#define     REG_PWM_CNR0    (PWM_BA+0x0C)  /*!< PWM Counter Register 0 */
#define     REG_PWM_CMR0    (PWM_BA+0x10)  /*!< PWM Comparator Register 0 */
#define     REG_PWM_PDR0    (PWM_BA+0x14)  /*!< PWM Data Register 0 */
#define     REG_PWM_CNR1    (PWM_BA+0x18)  /*!< PWM Counter Register 1 */
#define     REG_PWM_CMR1    (PWM_BA+0x1C)  /*!< PWM Comparator Register 1 */
#define     REG_PWM_PDR1    (PWM_BA+0x20)  /*!< PWM Data Register 1 */
#define     REG_PWM_CNR2    (PWM_BA+0x24)  /*!< PWM Counter Register 2 */
#define     REG_PWM_CMR2    (PWM_BA+0x28)  /*!< PWM Comparator Register 2 */
#define     REG_PWM_PDR2    (PWM_BA+0x2C)  /*!< PWM Data Register 2 */
#define     REG_PWM_CNR3    (PWM_BA+0x30)  /*!< PWM Counter Register 3 */
#define     REG_PWM_CMR3    (PWM_BA+0x34)  /*!< PWM Comparator Register 3 */
#define     REG_PWM_PDR3    (PWM_BA+0x38)  /*!< PWM Data Register 3 */
#define     REG_PWM_PIER    (PWM_BA+0x3C)  /*!< PWM Timer Interrupt Enable Register */
#define     REG_PWM_PIIR    (PWM_BA+0x40)  /*!< PWM Timer Interrupt Identification Register */

